import pandas as pd

# Suppose data for product hair and skin
data = [
    {"question": "ما هي أفضل منتجات لعلاج تساقط الشعر؟", 
     "answer": "سيروم الشعر بالكافيين وزيت الخروع يساعدان على تقوية البصيلات وتقليل التساقط."},

    {"question": "هل المنتجات مناسبة للبشرة الحساسة؟", 
     "answer": "نعم، منتجاتنا خالية من الكحول والعطور الصناعية ومناسبة للبشرة الحساسة."},

    {"question": "طريقة استخدام كريم الترطيب؟", 
     "answer": "يُوضع مرتين يوميًا على بشرة نظيفة وجافة، صباحًا ومساءً."},

    {"question": "هل يوجد منتجات طبيعية 100%؟", 
     "answer": "نعم، لدينا مجموعة الأعشاب الطبيعية للشعر والبشرة بدون أي إضافات كيميائية."},

    {"question": "هل يوجد شحن مجاني؟", 
     "answer": "الشحن مجاني للطلبات فوق 500 جنيه داخل مصر."}
]

df = pd.DataFrame(data)
df.to_csv("knowledge.csv", index=False, encoding="utf-8")

print("saved Knowledge Successfully")
